notes/20260313193152-post_making_notes_ideas_quotes.org
:PROPERTIES:
:ID:       176bea91-d8f4-4879-8a73-cba48548e425
:END:
#+title: post making notes ideas quotes
#+setupfile: ../org-html-themes/simple_gray.theme
* if we date you dont have to worry about me cheaing i might get lost hiking or die but thats really it.
* before you book a trek
** trekking is commitment to the mountains and to yoursel.
** this is not a tour
- a trek will rain on you. the summit may be shut by weather. you will be cold, tired. and far from you comfort zone.
- but thats the point.
** prepare like you mean it.
- most show up hoping the mountain will be forgiving. they wont be.
- the ones who thrive are ones who trained for it. built the stamina, packed smart, showed up ready to be an asset to their team not a burden.
  #+begin_quote
by preparing well, you become an equal member of the team not a burden or hindrance.
- arjun majundar indiahikes founder
#+end_quote
** carry you own weight
- you wash your own dishes. its better to be able to dot hihgnds ourselves and not treat others like they are there to serve us.
- self reliance isnta rule here its a mindset. nobody is here to serve you everyone is here to trek together.
** the team goes together.
- being supportive is about putting the team first. often this comes with sacrifice.
- being supportive helps us look beyond our needs and focus on the groups or fellow  trekker well being.
- trekking is 
