20260313193152-post_making_notes_ideas_quotes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-29 Sun 12:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>post making notes ideas quotes</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">post making notes ideas quotes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org84bdf51">if we date you dont have to worry about me cheaing i might get lost hiking or die but thats really it.</a></li>
<li><a href="#org6f249f3">before you book a trek</a>
<ul>
<li><a href="#org4cdf40f">trekking is commitment to the mountains and to yoursel.</a></li>
<li><a href="#org4f60a1c">this is not a tour</a></li>
<li><a href="#org964d032">prepare like you mean it.</a></li>
<li><a href="#org7e74a96">carry you own weight</a></li>
<li><a href="#org7575a35">the team goes together.</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org84bdf51" class="outline-2">
<h2 id="org84bdf51">if we date you dont have to worry about me cheaing i might get lost hiking or die but thats really it.</h2>
</div>
<div id="outline-container-org6f249f3" class="outline-2">
<h2 id="org6f249f3">before you book a trek</h2>
<div class="outline-text-2" id="text-org6f249f3">
</div>
<div id="outline-container-org4cdf40f" class="outline-3">
<h3 id="org4cdf40f">trekking is commitment to the mountains and to yoursel.</h3>
</div>
<div id="outline-container-org4f60a1c" class="outline-3">
<h3 id="org4f60a1c">this is not a tour</h3>
<div class="outline-text-3" id="text-org4f60a1c">
<ul class="org-ul">
<li>a trek will rain on you. the summit may be shut by weather. you will be cold, tired. and far from you comfort zone.</li>
<li>but thats the point.</li>
</ul>
</div>
</div>
<div id="outline-container-org964d032" class="outline-3">
<h3 id="org964d032">prepare like you mean it.</h3>
<div class="outline-text-3" id="text-org964d032">
<ul class="org-ul">
<li>most show up hoping the mountain will be forgiving. they wont be.</li>
<li><p>
the ones who thrive are ones who trained for it. built the stamina, packed smart, showed up ready to be an asset to their team not a burden.
</p>
<blockquote>
<p>
by preparing well, you become an equal member of the team not a burden or hindrance.
</p>
<ul class="org-ul">
<li>arjun majundar indiahikes founder</li>
</ul>
</blockquote></li>
</ul>
</div>
</div>
<div id="outline-container-org7e74a96" class="outline-3">
<h3 id="org7e74a96">carry you own weight</h3>
<div class="outline-text-3" id="text-org7e74a96">
<ul class="org-ul">
<li>you wash your own dishes. its better to be able to dot hihgnds ourselves and not treat others like they are there to serve us.</li>
<li>self reliance isnta rule here its a mindset. nobody is here to serve you everyone is here to trek together.</li>
</ul>
</div>
</div>
<div id="outline-container-org7575a35" class="outline-3">
<h3 id="org7575a35">the team goes together.</h3>
<div class="outline-text-3" id="text-org7575a35">
<ul class="org-ul">
<li>being supportive is about putting the team first. often this comes with sacrifice.</li>
<li>being supportive helps us look beyond our needs and focus on the groups or fellow  trekker well being.</li>
<li>trekking is</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>